BUNNY:
=================
רמת קושי: 2
-----------------
המשחק "BUNNY" הוא משחק טקסטואלי שבו השחקן מנסה למצוא ארנב, המוסתר באחד מעשרה מקומות.
השחקן בוחר מספר מקום, והמשחק מודיע האם הארנב נמצא במקום זה. המשחק נמשך עד אשר הארנב נמצא.

כללי המשחק:
1. הארנב מוסתר באקראי באחד מעשרה מקומות (ממוספרים מ-1 עד 10).
2. השחקן בוחר את מספר המקום שבו, לדעתו, נמצא הארנב.
3. המשחק מודיע האם הארנב נמצא במקום הנבחר.
4. המשחק מסתיים כאשר הארנב נמצא.
-----------------
אלגוריתם:
1. יצירת מספר אקראי בטווח שבין 1 ל-10, אשר ייצג את המקום שבו הארנב מוסתר.
2. התחלת לולאת "כל עוד הארנב לא נמצא":
   2.1 בקשת קלט מהשחקן עבור מספר המקום בין 1 ל-10.
   2.2 אם מספר המקום שווה למקום שבו הארנב מוסתר, הצגת ההודעה "You found him!".
      2.2.1 סיום המשחק.
   2.3 אחרת, אם מספר המקום אינו שווה למקום שבו הארנב מוסתר, הצגת ההודעה "He's not there.".
      2.3.1 המשך המשחק (חזרה לתחילת הלולאה).
-----------------

"""
import random

# יצירת מספר אקראי בין 1 ל-10 עבור מקום הארנב
bunnyLocation = random.randint(1, 10)

# לולאת המשחק הראשית
while True:
    # בקשת מספר המקום מהמשתמש
    try:
        userLocation = int(input("איפה הארנב (1-10)? "))
    except ValueError:
        print("אנא הזן מספר שלם בין 1 ל-10.")
        continue

    # בדיקה האם המשתמש ניחש את מקום הארנב
    if userLocation == bunnyLocation:
        print("You found him!")  # הצגת הודעה אם הארנב נמצא
        break  # סיום הלולאה אם הארנב נמצא
    else:
        print("He's not there.")  # הצגת הודעה אם הארנב לא נמצא