"""
ANIMAL:
=================
מורכבות: 4
-----------------
המשחק "ANIMAL" הוא משחק ניחוש חיות, שבו המחשב בוחר חיה אקראית מרשימה, והשחקן מנסה לנחש אותה על ידי הזנת ניחושיו. המשחק נמשך עד אשר השחקן מנחש את החיה נכונה.

כללי המשחק:
1.  המחשב בוחר חיה אקראית מרשימה מוגדרת מראש.
2.  השחקן מזין את ניחושיו לגבי החיה שהוגרלה.
3.  לאחר כל ניסיון, המחשב מודיע האם השחקן ניחש את החיה נכונה או לא.
4.  המשחק נמשך עד אשר השחקן מנחש את החיה שהוגרלה.
-----------------
אלגוריתם:
1.  להגדיר רשימת חיות.
2.  לבחור חיה אקראית מהרשימה.
3.  התחל לולאה "כל עוד החיה לא נוחשה":
    3.1 לבקש מהשחקן להזין שם חיה.
    3.2 אם השם שהוזן תואם את החיה שהוגרלה, עבור לשלב 4.
    3.3 אחרת, להדפיס הודעה "לא".
4. להדפיס הודעה "נכון!".
5. סיום המשחק.
-----------------
"""
import random

# רשימת חיות למשחק
animals = ['DOG', 'CAT', 'HORSE', 'COW', 'PIG']

# בוחרים חיה אקראית מהרשימה
targetAnimal = random.choice(animals)

# מתחילים לולאה כל עוד החיה לא נוחשה
while True:
    # מבקשים מהמשתמש להזין שם חיה
    userAnimal = input("נחשו את החיה (DOG, CAT, HORSE, COW, PIG): ").upper()

    # בודקים האם המשתמש ניחש את החיה
    if userAnimal == targetAnimal:
        print("נכון!") # מודיעים על התשובה הנכונה
        break # מסיימים את הלולאה אם החיה נוחשה
    else:
        print("לא") # מודיעים על תשובה שגויה